tf10_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>AcceptDocument</wsa:Action>
    <wsa:MessageID>urn:uuid:35a7ae14-de39-484e-b852-2354373e07f0</wsa:MessageID>
    <wsa:To>https://te-ws.puesc.gov.pl/seap_wsChannel/DocumentHandlingPort</wsa:To>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>rtbtrt6@gmail.com</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">1FZll5NfhdfeYS6+imjMUbXGssA=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GwcV7BE5dZ063mRdyrN0Eg==</wsse:Nonce>
        <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2022-09-21T06:59:46+00:00</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:AcceptDocumentRequest xmlns:ns0="http://www.mf.gov.pl/uslugiBiznesowe/WsPull/Usluga/2014/01_v2_0">
      <ns1:document xmlns:ns1="http://www.mf.gov.pl/schematy/SISC/WsChannel/2014/01_v2_0">
        <ns1:content filename="taxfree.xml" mime="application/xml">P3htbCB2ZXJzaW9uPSIxLjAiIGVuY29kaW5nPSJVVEYtOCI/Pgo8dG5zOktvbXVuaWthdEJsZWR1IHhtbG5zOnRucz0iaHR0cDovL3RheGZyZWUuZ292LnBsL3RmMTAiCnhtbG5zOnRuczE9Imh0dHA6Ly90YXhmcmVlLmdvdi5wbC90ZnR5cGVzLyIKeG1sbnM6eHNpPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYS1pbnN0YW5jZSIKeHNpOnNjaGVtYUxvY2F0aW9uPSJodHRwOi8vdGF4ZnJlZS5nb3YucGwvdGYxMCI+Cjx0bnM6SWRlbnR5ZmlrYXRvcj5URi4zfDIxUEwwMFRGMDAwMTIzNDU2fDIwMjEtMDEtCjAxVDEyOjAwOjEyPC90bnM6SWRlbnR5ZmlrYXRvcj4KPHRuczpLb2RCbGVkdT5UMDAxPC90bnM6S29kQmxlZHU+Cjx0bnM6T3Bpc0JsZWR1Pld5c3TEhXBpxYIgYsWCxIVkPC90bnM6T3Bpc0JsZWR1Pgo8L3RuczpLb211bmlrYXRCbGVkdT4K</ns1:content>
        <ns1:targetSystems>
          <ns1:system>TAX FREE</ns1:system>
        </ns1:targetSystems>
      </ns1:document>
    </ns0:AcceptDocumentRequest>
  </soap-env:Body>
</soap-env:Envelope>
